Repository: wongsyrone/luci-1
Catalog: applications/luci-app-dnscrypt-proxy/po/*/dnscrypt-proxy.po
Languages: ga

source: Advanced
ga: Ardleibhéal

source: Alternate Resolver List
ga: Liosta Malartach Resolver

source: Apply DNSCrypt-Proxy specific settings to the Dnsmasq configuration.<br />
ga: Cuir socruithe sonracha DNSCrypt-Proxy i bhfeidhm ar chumraíocht Dnsmasq.<br />

source: Blacklist
ga: Liosta Dubh

source: Block IPv6
ga: Bloc IPv6

source: By default the DNSCrypt-Proxy startup will be triggered by ifup events of 'All' available network interfaces.<br />
ga: De réir réamhshocraithe cuirfear tús le tosaithe DNSCrypt-Proxy ag imeachtaí ifup de na comhéadain líonra atá ar fáil 'All'.<br />

source: Configuration of the DNSCrypt-Proxy package.
ga: Cumraíocht an phacáiste DNSCrypt-Proxy.

source: Create '/etc/resolv-crypt.conf' with 'options timeout:1' to reduce DNS upstream timeouts with multiple DNSCrypt instances.<br />
ga: Cruthaigh '/etc/resolv-crypt.conf' le 'am istigh roghanna:1' chun amanna ama réamhtheachtacha DNS a laghdú le go leor cásanna DNSCrypt.<br />

source: Create Config File
ga: Cruthaigh Comhad Cumraíochta

source: Create Custom Config File
ga: Cruthaigh Comhad Cumraíochta Saincheaptha

source: DNS Query Logfile
ga: Logchomhad Iarratas DNS

source: DNSCrypt-Proxy
ga: DNSCrypt-Seachfhreastalaí

source: DNSCrypt-Proxy Logfile
ga: Logchomhad DNSCrypt-Proxy

source: DNSCrypt-Proxy Resolver List
ga: Liosta DNSCrypt-Proxy Resolver

source: Default Resolver List
ga: Liosta Réamhshocraithe Resolver

source: Disable IPv6 to speed up DNSCrypt-Proxy.
ga: Díchumasaigh IPv6 chun DNSCrypt-Proxy a bhrostú.

source: Dnsmasq Options
ga: Roghanna Dnsmasq

source: Download the current resolver list from 'github.com/dyne/dnscrypt-proxy'.
ga: Íoslódáil an liosta réitithe reatha ó 'github.com/dyne/dnscrypt-proxy'.

source: Edit DNSCrypt-Proxy Configuration
ga: Cuir Cumraíocht DNSCrypt-Proxy in eagar

source: Edit Dnsmasq Configuration
ga: Cuir Cumraíocht Dnsmasq in eagar

source: Edit Resolvcrypt Configuration
ga: Cuir Cumraíocht Resolvcrypt in Eagar

source: Enable Caching to speed up DNSCcrypt-Proxy.
ga: Cumasaigh Taisce chun DNSCcrypt-Proxy a bhrostú.

source: Ephemeral Keys
ga: Eochracha Ephemeral

source: File Checksum
ga: Seiceáil Comhad

source: File Date
ga: Dáta an Chomhaid

source: For further information <a href="%s" target="_blank">see the wiki online</a>
ga: Le haghaidh tuilleadh eolais <a href="%s" target="_blank">féach an vicí ar líne</a>

source: General Options
ga: Roghanna Ginearálta

source: Grant UCI access for luci-app-dnscrypt-proxy
ga: Deonaigh rochtain UCI do luci-app-dnscrypt-proxy

source: IP Address
ga: Seoladh IP

source: Improve privacy by using an ephemeral public key for each query.
ga: Feabhsaigh príobháideacht trí eochair phoiblí ghearrshaolach a úsáid do gach ceist.

source: Input file not found, please check your configuration.
ga: Níor aimsíodh an comhad ionchuir, seiceáil do chumraíocht.

source: Instance Options
ga: Roghanna Céide

source: Local Cache
ga: Taisce Áitiúil

source: Local blacklists allow you to block abuse sites by domains or ip addresses.
ga: Ligeann liostaí dubha áitiúla duit suíomhanna mí-úsáide a bhlocáil de réir fearainn nó seoltaí IP.

source: Log the received DNS queries to a file, so you can watch in real-time what is happening on the network.
ga: Logáil isteach na fiosruithe DNS faighte i gcomhad, ionas gur féidir leat féachaint i bhfíor-am ar a bhfuil ag tarlú ar an líonra.

source: Name of the remote DNS service for resolving queries incl. Location, DNSSEC- and NOLOG-Flag.
ga: Ainm na seirbhíse cianda DNS chun ceisteanna a réiteach lena n-áirítear. Suíomh, DNSSEC- agus NOLOG-Flag.

source: No SSL support available.<br />
ga: Níl tacaíocht SSL ar fáil.<br />

source: No default resolver list and no SSL support available.<br />
ga: Níl aon liosta réamhshocraithe réititheora agus níl aon tacaíocht SSL ar fáil.<br />

source: Overview
ga: Forbhreathnú

source: Please edit the file manually in the 'Advanced' section.
ga: Cuir an comhad in eagar de láimh sa rannán 'Ard'.

source: Please install a 'libustream-ssl' library to download the current resolver list from 'github.com/dyne/dnscrypt-proxy'.
ga: Suiteáil leabharlann 'libustream-ssl' chun an liosta réitithe reatha a íoslódáil ó 'github.com/dyne/dnscrypt-proxy'.

source: Please install a resolver list to '/usr/share/dnscrypt-proxy/dnscrypt-resolvers.csv' to use this package.
ga: Suiteáil liosta réititheora chuig '/usr/share/dnscrypt-proxy/dnscrypt-resolvers.csv' chun an pacáiste seo a úsáid.

source: Please note: This may change the values for 'noresolv', 'resolvfile', 'allservers' and the list 'server' settings.
ga: Tabhair faoi deara: Seans go n-athróidh sé seo na luachanna do shocruithe 'noresolv', 'resolvfile', 'allserver' agus an liosta 'freastalaí'.

source: Port
ga: Calafort

source: Refresh List
ga: Liosta Athnuaigh

source: Refresh Resolver List
ga: Athnuaigh Liosta Reacair

source: Save
ga: Sábháil

source: Specify a non-default Resolver List.
ga: Sonraigh Liosta Resolver neamhréamhshocraithe.

source: Startup Trigger
ga: Truicear Tosaithe

source: The config file '/etc/resolv-crypt.conf' already exist.<br />
ga: Tá an comhad cumraíochta '/etc/resolv-crypt.conf' ann cheana.<br />

source: The listening port for DNS queries.
ga: An port éisteachta le haghaidh ceisteanna DNS.

source: The local IPv4 or IPv6 address. The latter one should be specified within brackets, e.g. '[::1]'.
ga: An seoladh IPv4 nó IPv6 áitiúil. Ba cheart an ceann deireanach a shonrú laistigh de lúibíní, e.g. ‘[::1]’.

source: The value for this property is the blocklist type and path to the file, e.g.'domains:/path/to/dbl.txt' or 'ips:/path/to/ipbl.txt'.
ga: Is é luach na maoine seo an cineál blocliosta agus cosán an chomhaid, m.sh. 'domains:/path/to/dbl.txt' nó 'ips:/path/to/ipbl.txt'.

source: This form allows you to modify the content of the main DNSCrypt-Proxy configuration file (/etc/config/dnscrypt-proxy).
ga: Ligeann an fhoirm seo duit ábhar an phríomhchomhad cumraíochta DNSCrypt-Proxy (/etc/config/dnscrypt-proxy) a mhodhnú.

source: This form allows you to modify the content of the main Dnsmasq configuration file (/etc/config/dhcp).
ga: Ligeann an fhoirm seo duit ábhar an phríomhchomhad cumraíochta Dnsmasq (/etc/config/dhcp) a mhionathrú.

source: This form allows you to modify the content of the resolv-crypt configuration file (/etc/resolv-crypt.conf).
ga: Ligeann an fhoirm seo duit ábhar an chomhaid chumraíochta resolv-crypt (/etc/resolv-crypt.conf) a mhodhnú.

source: This form shows the content of the current DNSCrypt Resolver List.
ga: Taispeánann an fhoirm seo inneachar Liosta reatha DNSCrypt Resolver.

source: This form shows the syslog output, pre-filtered for DNSCrypt-Proxy related messages only.
ga: Taispeánann an fhoirm seo an t-aschur syslog, réamhscagtha do theachtaireachtaí a bhaineann le DNSCrypt-Proxy amháin.

source: This option requires extra CPU cycles and is useless with most DNSCrypt server.
ga: Teastaíonn timthriallta LAP breise ón rogha seo agus tá sé gan úsáid leis an gcuid is mó de fhreastalaí DNSCrypt.

source: To restrict the trigger, select only the relevant network interface. Usually the 'wan' interface should work for most users.
ga: Chun an truicear a shrianadh, roghnaigh an comhéadan líonra ábhartha amháin. De ghnáth ba cheart go n-oibreodh an comhéadan 'wan' don chuid is mó d'úsáideoirí.

source: Transfer Options To Dnsmasq
ga: Roghanna Aistrithe Go Dnsmasq

source: View Logfile
ga: Féach Logchomhad

source: View Resolver List
ga: Féach ar Liosta Resolver
