Repository: wongsyrone/luci-1
Catalog: applications/luci-app-ahcp/po/*/ahcp.po
Languages: ga

source: AHCP Server
ga: Freastalaí AHCP

source: AHCP is an autoconfiguration protocol for IPv6 and dual-stack IPv6/IPv4 networks designed to be used in place of router discovery or DHCP on networks where it is difficult or impossible to configure a server within every link-layer broadcast domain, for example mobile ad-hoc networks.
ga: Is prótacal uathchumraíochta é AHCP le haghaidh líonraí IPv6/IPv4 dé-staca agus atá deartha le húsáid in ionad fionnachtain ródaire nó DHCP ar líonraí ina bhfuil sé deacair nó dodhéanta freastalaí a chumrú laistigh de gach fearann craolta nasc-chiseal, mar shampla fógra soghluaiste -hoc líonraí.

source: Active AHCP Leases
ga: Léasanna Gníomhacha AHCP

source: Address
ga: Seoladh

source: Advanced Settings
ga: Socruithe chun cinn

source: Age
ga: Aois

source: Announced DNS servers
ga: Freastalaithe DNS fógartha

source: Announced NTP servers
ga: Freastalaithe NTP fógartha

source: Announced prefixes
ga: Réimíreanna fógartha

source: Collecting data...
ga: Sonraí a bhailiú...

source: Disable DNS setup
ga: Díchumasaigh an socrú DNS

source: Forwarder
ga: Seoltóir

source: General Setup
ga: Socrú Ginearálta

source: Grant UCI access for luci-app-ahcp
ga: Deonaigh rochtain UCI ar luci-app-ahcp

source: IPv4 and IPv6
ga: IPv4 agus IPv6

source: IPv4 only
ga: IPv4 amháin

source: IPv6 only
ga: IPv6 amháin

source: Lease directory
ga: Eolaire léasa

source: Lease validity time
ga: Am bailíochta léasa

source: Log file
ga: Comhad logála

source: Multicast address
ga: Seoladh ilchraolacháin

source: Operation mode
ga: Modh oibríochta

source: Port
ga: Calafort

source: Protocol family
ga: Teaghlaigh Prótacail

source: Served interfaces
ga: Comhéadain sheirbheáil

source: Server
ga: Freastalaí

source: Specifies the announced IPv4 and IPv6 NTP servers
ga: Sonraítear na freastalaithe IPv4 agus IPv6 NTP fógartha

source: Specifies the announced IPv4 and IPv6 name servers
ga: Sonraítear na freastalaithe ainm IPv4 agus IPv6 fógartha

source: Specifies the announced IPv4 and IPv6 network prefixes in CIDR notation
ga: Sonraítear na réimírí líonra IPv4 agus IPv6 fógartha i nodaireacht CIDR

source: The AHCP Service is not running.
ga: Níl an tSeirbhís AHCP á rith.

source: The AHCP Service is running with ID %s.
ga: Tá an tSeirbhís AHCP ag rith le haitheantas %s.

source: There are no active leases.
ga: Níl aon léasanna gníomhacha ann.

source: Unique ID file
ga: Comhad aitheantais uathúil
